clackups/draftling/firmware/sdkconfig.defaults.lilygo_t5_epd_s3_pro
# CMakePresets.json board defaults: LilyGO T5 E-Paper S3 Pro / Pro Lite
# Sets the hardware model and IDF target used by the "lilygo_t5_epd_s3_pro" preset.

CONFIG_IDF_TARGET="esp32s3"
CONFIG_DRAFTLING_MODEL_LILYGO_T5_EPD_S3_PRO=y

# "SD card via USB" (F1 menu): expose the on-board MicroSD as a USB
# Mass Storage device over the ESP32-S3's native USB port. See
# components/usb_msc.
CONFIG_TINYUSB_MSC_ENABLED=y
